src/InformationRegisters/Промокоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Промокоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Промокоды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Промокоды/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Доступность = НЕ Параметры.Свойство("ПросмотрЗаписи"); 
	Элементы.Владелец.ТолькоПросмотр = Истина;
	Элементы.Вид.ТолькоПросмотр		 = Истина;             
	
КонецПроцедуры  

&НаСервере    
// Процедура - Перед записью на сервере.
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Промокоды.Промокод КАК Промокод
	|ИЗ
	|	РегистрСведений.Промокоды КАК Промокоды
	|ГДЕ
	|	Промокоды.Промокод = &Промокод
	|	И НЕ(Промокоды.Вид = &Вид
	|				И Промокоды.Владелец = &Владелец)");
	
	Запрос.УстановитьПараметр("Промокод", Запись.Промокод);
	Запрос.УстановитьПараметр("Владелец", Запись.Владелец);
	Запрос.УстановитьПараметр("Вид"		, Запись.Вид);
	
	Отказ = Запрос.Выполнить().Выбрать().Следующий();
	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю("Такой промокод уже существует!");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте 
// Процедура - После записи.
//
Процедура ПослеЗаписи(ПараметрыЗаписи)    
	
	Оповестить("ОбновленыПромокоды");   
	
КонецПроцедуры          

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте 
// Процедура - Скрыть/Показать Дополнительно.
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

&НаКлиенте      
// Процедура - Удалить промокод.
//
Процедура УдалитьПромокод(Команда)    
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьПромокодЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "После удаления данный реферальный код будет более недоступен. Продолжить удаление?", РежимДиалогаВопрос.ДаНет,,, "Предупреждение");
	
КонецПроцедуры    

&НаКлиенте
// Процедура - Удалить промокод на сервере
//
Процедура УдалитьПромокодЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Если УдалитьПромокодНаСервере() Тогда	
			Оповестить("ОбновленыПромокоды");
			Закрыть();
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка. Не удалось удалить промокод");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Удалить промокод на сервере
//
Функция УдалитьПромокодНаСервере()
	
	ПараметрыДанныхУдаления = Новый Структура;
	ПараметрыДанныхУдаления.Вставить("Вид"		, Запись.Вид);
	ПараметрыДанныхУдаления.Вставить("Владелец"	, Запись.Владелец);
	
	Возврат РегистрыСведений.Промокоды.УдалитьПромокодКонтрагента(ПараметрыДанныхУдаления);	
	
КонецФункции

#КонецОбласти
